The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI.
  Namespace:   Autodesk.Revit.DB.ExternalService
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }
  Visual Basic
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropUIService As ExternalServiceId
	Get
  Visual C++
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropUIService {
	ExternalServiceId^ get ();
}
 See Also
  ExternalServices BuiltInExternalServices Class
  Autodesk.Revit.DB.ExternalService Namespace